# Вычислить число c заданной точностью d

import math

_pi = math.pi
num = int(input('Введите число d: '))
a = round(_pi, num)
print(a)


